Для открытия preview: ctrl + shift + v

1. **Функции для форматированного ввода/вывода:**

   - `printf`: для форматированного вывода данных.
   - `scanf`: для форматированного ввода данных.

2. **Формат ввода/вывода для `scanf()` и `printf()`:**

   - Для `printf()`: `printf("Формат", аргументы);`
   - Для `scanf()`: `scanf("Формат", переменные);`

3. **Размер вводимых/выводимых данных в `scanf()` и `printf()`:**
   - `%d`, `%f`, `%s` - для целых чисел, чисел с плавающей запятой и строк соответственно.
   - `%5d`, `%8.2f`, `%10s` - задают размер поля для вывода/ввода (например, 5 знаков для целого числа, 8 знаков, в том числе 2 после запятой, для числа с плавающей запятой, 10 символов для строки).

**Примеры:**

```c
int num;
char str[20];
float value;

// Ввод числа, строки и числа с плавающей запятой
scanf("%d %19s %f", &num, str, &value);

// Вывод числа, строки и числа с плавающей запятой с заданными размерами полей
printf("%5d %-20s %8.2f", num, str, value);
```
